<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Admin Controller
    |--------------------------------------------------------------------------
    */

    'admin.active' => '公开',
    'admin.inactive' => '关闭',

    /*
    |--------------------------------------------------------------------------
    | Member Controller
    |--------------------------------------------------------------------------
    */

    'member.active' => '公开',
    'member.inactive' => '关闭',
    'member.suspended.no' => '否',
    'member.suspended.yes' => '是',

    /*
    |--------------------------------------------------------------------------
    | Merchant Controller
    |--------------------------------------------------------------------------
    */

    'merchant.active' => '公开',
    'merchant.inactive' => '关闭',
    'merchant.suspended.no' => '否',
    'merchant.suspended.yes' => '是',

    /*
    |--------------------------------------------------------------------------
    | Subaccount Controller
    |--------------------------------------------------------------------------
    */

    'subaccount.active' => '公开',
    'subaccount.inactive' => '关闭',

    /*
    |--------------------------------------------------------------------------
    | BankInfo Controller
    |--------------------------------------------------------------------------
    */

    'bank.active' => '公开',
    'bank.inactive' => '关闭',
    'bank.suspended.no' => '否',
    'bank.suspended.yes' => '是',
    /*
    |--------------------------------------------------------------------------
    | Win Loss Controller
    |--------------------------------------------------------------------------
    */

    'winloss.win' => '赢',
    'winloss.lose' => '输',
    'winloss.tie' => '和',

    'winloss.product.evo' => 'Evo',
    'winloss.product.haba' => 'Haba',
    'winloss.product.prag' => 'Prag',
    'winloss.product.wm' => 'Wm',

    /*
    |--------------------------------------------------------------------------
    | BetHistory Controller
    |--------------------------------------------------------------------------
    */

    'txn.win' => '赢',
    'txn.lose' => '输',
    'txn.tie' => '和',
    'txn.all' => '全部',
    'txn.refund' => '退还',
    'txn.pending' => '待定',

     /*
    |--------------------------------------------------------------------------
    | Agent Credit Controller
    |--------------------------------------------------------------------------
    */

    'agent.credit.agent.deposit' => '创建代理充值信用額',
    'agent.credit.agent.withdraw' => '创建代理提取信用額',
    'agent.credit.add' => '充值信用額',
    'agent.credit.reduce' => '提取信用額',
    'agent.credit.member.deposit' => '创建会员充值信用額',

    /*
    |--------------------------------------------------------------------------
    | Member Credit Controller
    |--------------------------------------------------------------------------
    */

    'member.credit.deposit' => '创建会员充值信用額',
    'member.credit.add' => '充值信用額',
    'member.credit.reduce' => '提取信用額',

    /*
    |--------------------------------------------------------------------------
    | Member Message Controller
    |--------------------------------------------------------------------------
    */
    'member.msg.admin' => '代理',
    'member.msg.member' => '会员',

    /*
    |--------------------------------------------------------------------------
    | MemberDW Controller
    |--------------------------------------------------------------------------
    */
    'member.dw.deposit' => '存款',
    'member.dw.withdraw' => '提款',
    'member.dw.bank' => '银行',
    'member.dw.cash' => '现金',
    'member.dw.crypto' => '加密货币',
    'member.dw.new' => '待定  ',
    'member.dw.approved' => '已批准',
    'member.dw.rejected' => '已拒绝',
    'member.dw.processing' => '处理中',
    'member.dw.cancelled' => '已取消',
];
