<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Admin Controller
    |--------------------------------------------------------------------------
    */

    'admin.active' => 'افتح',
    'admin.inactive' => 'مغلق',

    /*
    |--------------------------------------------------------------------------
    | Member Controller
    |--------------------------------------------------------------------------
    */

    'member.active' => 'افتح',
    'member.inactive' => 'مغلق',
    'member.suspended.no' => 'لا',
    'member.suspended.yes' => 'نعم',

    /*
    |--------------------------------------------------------------------------
    | Merchant Controller
    |--------------------------------------------------------------------------
    */

    'merchant.active' => 'افتح',
    'merchant.inactive' => 'مغلق',
    'merchant.suspended.no' => 'لا',
    'merchant.suspended.yes' => 'نعم',

    /*
    |--------------------------------------------------------------------------
    | Subaccount Controller
    |--------------------------------------------------------------------------
    */

    'subaccount.active' => 'افتح',
    'subaccount.inactive' => 'مغلق',

    /*
    |--------------------------------------------------------------------------
    | BankInfo Controller
    |--------------------------------------------------------------------------
    */

    'bank.active' => 'افتح',
    'bank.inactive' => 'مغلق',

    /*
    |--------------------------------------------------------------------------
    | Win Loss Controller
    |--------------------------------------------------------------------------
    */

    'winloss.win' => 'يفوز',
    'winloss.lose' => 'تخسر',
    'winloss.tie' => 'ربطة عنق',

    'winloss.product.evo' => 'ايفو',
    'winloss.product.haba' => 'هابا',
    'winloss.product.prag' => 'براغ',
    'winloss.product.wm' => 'وات',

    /*
    |--------------------------------------------------------------------------
    | BetHistory Controller
    |--------------------------------------------------------------------------
    */

    'txn.win' => 'يفوز',
    'txn.lose' => 'تخسر',
    'txn.tie' => 'ربطة عنق',
    'txn.all' => 'الكل',
    'txn.refund' => 'إعادة مال',
    'txn.pending' => 'قيد الانتظار',

    /*
    |--------------------------------------------------------------------------
    | Agent Credit Controller
    |--------------------------------------------------------------------------
    */

    'agent.credit.agent.deposit' => 'إنشاء وكيل الإيداع الائتمان',
    'agent.credit.agent.withdraw' => 'خلق وكيل سحب الائتمان',
    'agent.credit.add' => 'إضافة رصيد',
    'agent.credit.reduce' => 'خفض الائتمان',
    'agent.credit.member.deposit' => 'إنشاء عضو الإيداع الائتمان',

    /*
    |--------------------------------------------------------------------------
    | Member Credit Controller
    |--------------------------------------------------------------------------
    */

    'member.credit.deposit' => 'إنشاء عضو الإيداع الائتمان',
    'member.credit.add' => 'إضافة رصيد',
    'member.credit.reduce' => 'خفض الائتمان',

    /*
    |--------------------------------------------------------------------------
    | Member Message Controller
    |--------------------------------------------------------------------------
    */
    'member.msg.admin' => 'مشرف',
    'member.msg.member' => 'عضو',

    /*
    |--------------------------------------------------------------------------
    | MemberDW Controller
    |--------------------------------------------------------------------------
    */
    'member.dw.deposit' => 'الوديعة',
    'member.dw.withdraw' => 'انسحب',
    'member.dw.bank' => 'مصرف',
    'member.dw.cash' => 'السيولة النقدية',
    'member.dw.new' => 'جديد',
    'member.dw.approved' => 'وافق',
    'member.dw.rejected' => 'مرفوض',
    'member.dw.cancelled' => 'ألغيت',
];
